// Напишите программу которая на вход принимает число  и выдает количество цифр в числе
void Length (int N) 
{
    string num = N.ToString();
   Console.WriteLine(num.Length);
}
Length(5657);